{
    "Projects": [
        {
            "id": "rotor", 
            "image": "../../images/rotor.png", 
            "layout": "project-inner-container text-first",
            "title": "Modern Ring Modulation Plugin", 
            "subtitle": "C++ audio effect made in JUCE", 
            "description": [
                "Because digital audio samples are just float values between -1 and 1, distortion can be created relatively simply by multiplying them with a real number so that it extends past -1 or 1. Such a simple distortion does require some fine tuning in order to \"sound good\", so the user has the ability to modify the gain (amplitude of signal), drive (intensity of distortion algorithm), and mix (blend between wet and dry signals).",
                "This plugin was created using the JUCE framework created by ROLI and uses C++. The distortion algorithm was designed in C using Bela.io, which allows me to quickly write and iterate on code that affects audio in realtime. I then implemented it into the JUCE project's audio processor to modify audio data based on parameters received from the GUI." 
            ], 
            "links": [
                {
                    "name": "GitHub",
                    "url": "https://github.com/maxwellmattryan/basic-distortion-plugin",
                    "logo": "../../logos/github.svg"
                },
                {
                    "name": "",
                    "url": "",
                    "logo": ""
                }
            ]
        },
        {
            "id": "green-foot", 
            "image": "../../images/green-foot.png", 
            "layout": "project-inner-container text-first",
            "title": "Green Foot", 
            "subtitle": "React JS application for reducing your carbon footprint", 
            "description": [
                "Green Foot is an environmentally conscious app concerned with helping you lower your carbon footprint. Provided a starting and target location by the user, it returns a list of modes of transportation ranked in increasing order according to their carbon emission amount.",
                "The frontend was built within the React JS framework and utilizes Redux JS to handle data between the store and the backend. The backend utilizes Node JS and Express JS to calculate results according to data from requests to Bing's VirtualEarth API and our own. The application was created out of a hackathon held locally in Austin, Texas in late September, 2019."
            ],
            "links": [
                {
                    "name": "GitHub",
                    "url": "https://github.com/Diversity-Hackathon/greenfoot-frontend",
                    "logo": "../../logos/github.svg"
                },
                {
                    "name": "Green Foot",
                    "url": "https://diversity-hackathon.github.io/greenfoot-frontend/#/",
                    "logo": "../../logos/green-foot.png"
                }
            ]
        },
        {
            "id": "operation-home", 
            "image": "../../images/operation-home.png", 
            "layout": "project-inner-container image-first",
            "title": "Operation H.O.M.E.", 
            "subtitle": "Arcade shooter made in Unity", 
            "description": [
                "Operation H.O.M.E. (\"Heck Off My Earth\") is a simple arcade shooter created for the 2019 Global Game Jam. The theme of this year's jam was \"home\" and what it represents to you. Does home mean a location, sound, smell, or feeling? My team decided that for us it meant defending the Earth from invading aliens.",
                "We used the Unity engine to build the game and I used Ableton Live 10 to design the sounds. I oversaw mainly sound design and audio implementation via C# scripting to ensure my assets were triggering appropriately. Things you'll hear include the UI/UX, a laser gun, and an arcade-y space atmosphere. I also wrote scripts for gameplay mechanics including player movement, enemy spawning behavior, and camera shake."
            ],
            "links": [
                {
                    "name": "GitHub",
                    "url": "https://github.com/maxwellmattryan/operation-home",
                    "logo": "../../logos/github.svg"
                },
                {
                    "name": "Itch.io",
                    "url": "https://maxwellmatt.itch.io/operation-home",
                    "logo": "../../logos/color_itch-dot-io.svg"
                }
            ]
        },
        {
            "id": "jlpt-scrape", 
            "image": "../../images/jlpt-scrape.png", 
            "layout": "project-inner-container image-first",
            "title": "JLPT Vocabulary Scraper", 
            "subtitle": "Python dictionary scraper", 
            "description": [
                "The Japanese Language Proficiency Test (JLPT) is notoriously rigorous. Passing the top level, referred to as N1 and considered to be roughly native Japanese level, requires the vocabulary of roughly 8,226 words (according to jisho.org). In order to study more efficiently, I wrote a script for scraping all of these words and storing their data in an accessible way.",
                "Using Python 3.7.4 and some of its libraries (beautiful soup, xlwt, lxml), the script searches the words that belong to the desired JLPT level, which is defined by the user. From the page's requested HTML, the script extracts the kanji, furigana, meaning(s), part of speech, and whether or not it is a commonly used word via HTML tags. Incidentally, this project was quite informative in seeing how a commonly used website structures its HTML according to specific data."
            ],
            "links": [
                {
                    "name": "GitHub",
                    "url": "https://github.com/maxwellmattryan/jisho-search",
                    "logo": "../../logos/github.svg"
                },
                {
                    "name": "Google Drive",
                    "url": "https://drive.google.com/drive/folders/1BAvCwVEkObtevfx9YwB0gGtDbqpndqsj?usp=sharing",
                    "logo": "../../logos/color_google-drive.svg"
                }
            ]
        }
    ],
    "Technologies": [
        {
            "name": "HTML 5",
            "logo": "../../logos/color_html5.svg"
        },
        {
            "name": "CSS 3",
            "logo": "../../logos/color_css3.svg"
        },
        {
            "name": "JavaScript",
            "logo": "../../logos/color_javascript.svg"
        },
        {
            "name": "Sass",
            "logo": "../../logos/color_sass.svg"
        },
        {
            "name": "React JS",
            "logo": "../../logos/color_reactjs.svg"
        },
        {
            "name": "Redux",
            "logo": "../../logos/color_redux.svg"
        },
        {
            "name": "Node JS",
            "logo": "../../logos/color_nodejs.svg"
        }
    ]
}