{
  "projects": [
    {
      "name": "Counterplay",
      "tagline": "Grid-based strategy game",
      "description": "Counterplay is a team project for the class, Video Game Systems Design (AET 334M), that demonstrates a unique intersection of primary, secondary, and progression systems. The purpose of the class is to gain a perspective of how video game systems shape an entire game's basis of gameplay through building an implementation.",
      "image_url": "counterplay.png",
      "external_url": "https://github.com/zero-sum-games/counterplay"
    },
    {
      "name": "Cozy Cat Cafe",
      "tagline": "Mellow game for feeding cats",
      "description": "Cozy Cat Cafe is an incredibly relaxing and chill game also created for the 2019 Global Game Jam where it won best of show. You indefinitely feed cats that appear on your patio doorstep in exchange for acorns. These acorns can be used to customize your kitchen by installing new walls or floors, hanging posters, and more.",
      "image_url": "cozy-cat-cafe.png",
      "external_url": "https://github.com/VeryBester/Cozy-Cat-Cafe"
    },
    {
      "name": "Green Foot",
      "tagline": "ReactJS application that helps reduce carbon footprints",
      "description": "Green Foot is an environmentally conscious app concerned with helping you lower your carbon footprint. Provided a starting and target location by the user, it returns a list of modes of transportation ranked in increasing order according to their carbon emission amount.",
      "image_url": "green-foot.png",
      "external_url": "https://github.com/Diversity-Hackathon/greenfoot-frontend"
    },
    {
      "name": "Operation H.O.M.E.",
      "tagline": "Arcade shooter made in Unity",
      "description": "Operation H.O.M.E. ('Heck Off My Earth') is a simple arcade shooter created for the 2019 Global Game Jam. The theme of the jam was 'home' and what it represents to you. Does home mean a location, sound, smell, or feeling? My team decided that for us it meant defending the Earth from invading aliens.",
      "image_url": "operation-home.png",
      "external_url": "https://github.com/maxwellmattryan/operation-home"
    },
    {
      "name": "Rotor",
      "tagline": "Modern C++ ring modulation plugin",
      "description": "Rotor is a variable waveform ring modulation plugin targeting VST3 and AU for OS X and Windows platforms. It uses wavetable synthesis to generate various simple waveforms that act as the modulation signal for the input. It is compiled using the JUCE framework for C++.",
      "image_url": "rotor.png",
      "external_url": "https://github.com/maxwellmattryan/rotor"
    }
  ]
}